Enums/РежимыВикторины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимыВикторины</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдинСборникБезОстановки</Name>
					<Comment>Бесконечные вопросы по одному сборнику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлучайныйСборник</Name>
					<Comment>Бесконечные вопросы по случайным сборникам на каждый вопрос</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испытание</Name>
					<Comment>100 вопросов по одному сборнику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восхождение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СложностиСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СложностиСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШестьОтветов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетыреОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Задания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Задания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Сборники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстВопросаЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветыЗаданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВосхождениеСервер/Ext/Module.bsl
#Область Карты

// Возвращает соответствие карт их данным.
// Ключ — ссылка на карту, значение — структура с полем Стоимость.
//
// Параметры:
//  МассивКартВход - Массив - массив ссылок типа СправочникСсылка.Карты.
//
// Возвращаемое значение:
//  Соответствие - карта → Структура (Стоимость).
//
Функция ПолучитьДанныеКарт(МассивКартВход) Экспорт
	РезультатФункции = Новый Соответствие;
	Если МассивКартВход = Неопределено ИЛИ МассивКартВход.Количество() = 0 Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Карты.Ссылка,
	|	Карты.Стоимость
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.Ссылка В (&МассивКарт)";
	Запрос.УстановитьПараметр("МассивКарт", МассивКартВход);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеКарты = Новый Структура;
		ДанныеКарты.Вставить("Стоимость", Выборка.Стоимость);
		РезультатФункции.Вставить(Выборка.Ссылка, ДанныеКарты);
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 // ПолучитьДанныеКарт()

// Возвращает стоимость указанной карты.
//
// Параметры:
//  КартаВход - СправочникСсылка.Карты - карта, стоимость которой требуется определить.
//
// Возвращаемое значение:
//  Число - стоимость карты в энергии; 0 если карта не найдена.
//
Функция ПолучитьСтоимостьКарты(КартаВход) Экспорт
	МассивОднойКарты = Новый Массив;
	МассивОднойКарты.Добавить(КартаВход);
	ДанныеКарты = ПолучитьДанныеКарт(МассивОднойКарты);
	СтруктураКарты = ДанныеКарты.Получить(КартаВход);
	Если СтруктураКарты <> Неопределено Тогда
		Возврат СтруктураКарты.Стоимость;
	КонецЕсли;
	Возврат 0;
КонецФункции

// Перемешивает таблицу-стопку карт ТаблицаИзм.
//
// Параметры:
//	ТаблицаИзм - ТаблицаФормы - Таблица, которую нужно перемешать.
//
Процедура ПеремешатьСтопку(ТаблицаИзм) Экспорт
	Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	ВременнаяТаблица = ТаблицаИзм.Выгрузить();
	ВременнаяТаблица.Колонки.Добавить("НомерКарты");
	Для Каждого ТекВременнаяТаблица Из ВременнаяТаблица Цикл
		ТекВременнаяТаблица.НомерКарты = ГСЧ.СлучайноеЧисло(0, 9999);
	КонецЦикла;
	ВременнаяТаблица.Сортировать("НомерКарты возр");
	ТаблицаИзм.Очистить();
	ТаблицаИзм.Загрузить(ВременнаяТаблица);
КонецПроцедуры		// ПеремешатьСтопку()

#КонецОбласти

#Область Викторина

// Возвращает структуру данных для задания ЗаданиеВход.
//
// Параметры:
//  СборникВход - СправочникСсылка.Сборники - сборник, которому принадлежит задание.
//  РежимВикториныВход - ПеречислениеСсылка.РежимыВикторины - текущий режим.
//  ЗаданиеВход - СправочникСсылка.Задания - задание, для которого генерируются варианты.
//
// Возвращаемое значение:
//  Структура - с ключами НомерПравильного (Число) и МассивОтветов (Массив).
//
Функция ПолучитьВариантыОтветов(СборникВход, РежимВикториныВход, ЗаданиеВход) Экспорт
	// Инициализация.
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("НомерПравильного", 0);
	РезультатФункции.Вставить("МассивОтветов", Новый Массив);
	Гсч = Новый ГенераторСлучайныхЧисел();
	// Определение количества ответов.
	ВыгрузкаОтветов = ЗаданиеВход.ОтветыЗаданий.Выгрузить();
	ЭтоРежимВосхождение = (РежимВикториныВход = Перечисления.РежимыВикторины.Восхождение);
	Если ЭтоРежимВосхождение Тогда
		КоличествоОтветов = 4;
	Иначе
		КоличествоОтветов = 6;
		Если СборникВход.Сложность = Перечисления.СложностиСборников.ШестьОтветов Тогда
			КоличествоОтветов = 6;
		ИначеЕсли СборникВход.Сложность = Перечисления.СложностиСборников.ЧетыреОтвета Тогда
			КоличествоОтветов = 4;
		Иначе
			КоличествоОтветов = 6;
		КонецЕсли;
	КонецЕсли;
	// Поиск правильного ответа.
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Правильность", Истина);
	НайденныеСтроки = ВыгрузкаОтветов.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 1 Тогда
		ПравильныйОтветСтрока = НайденныеСтроки[0];
		ПравильныйОтветТекст = ПравильныйОтветСтрока.ТекстОтвета;
		// Добавление неправильных ответов.
		МассивНеправильных = Новый Массив;
		ТекСборник = ЗаданиеВход.Владелец;
		Если ТекСборник.БратьОтветыИзТекущегоСборника Тогда
			// Ответы берутся только из текущего вопроса.
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаданияОтветыЗаданий.ТекстОтвета,
			|	ЗаданияОтветыЗаданий.Правильность
			|ИЗ
			|	Справочник.Задания.ОтветыЗаданий КАК ЗаданияОтветыЗаданий
			|ГДЕ
			|	ЗаданияОтветыЗаданий.Ссылка = &Ссылка
			|	И НЕ ЗаданияОтветыЗаданий.Ссылка.ПометкаУдаления
			|	И НЕ ЗаданияОтветыЗаданий.Правильность";
			Запрос.УстановитьПараметр("Ссылка", ЗаданиеВход);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МассивНеправильных.Добавить(ВыборкаДетальныеЗаписи.ТекстОтвета);
			КонецЦикла;
		Иначе
			// Ответы берутся из всех вопросов.
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданияОтветыЗаданий.ТекстОтвета
			|ИЗ
			|	Справочник.Задания.ОтветыЗаданий КАК ЗаданияОтветыЗаданий
			|ГДЕ
			|	ЗаданияОтветыЗаданий.ТекстОтвета <> &ТекстОтвета
			|	И НЕ ЗаданияОтветыЗаданий.Ссылка.ПометкаУдаления
			|	И ЗаданияОтветыЗаданий.Ссылка.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец", ЗаданиеВход.Владелец);
			Запрос.УстановитьПараметр("ТекстОтвета", ПравильныйОтветТекст);
			РезультатЗапроса = Запрос.Выполнить();
			ВыгрузкаНеправильных = РезультатЗапроса.Выгрузить();
			МассивВыгрузка = ВыгрузкаНеправильных.ВыгрузитьКолонку("ТекстОтвета");
			ВсегоНеправильных = МассивВыгрузка.Количество();
			ВерхняяГраница = 1;
			Если МассивВыгрузка.Количество() >= (КоличествоОтветов - 1) Тогда
				ВерхняяГраница = (КоличествоОтветов - 1);
			Иначе
				ВерхняяГраница = МассивВыгрузка.Количество();
			КонецЕсли;
			Для Счетчик = 1 По ВерхняяГраница Цикл
				НомерОтвета = Гсч.СлучайноеЧисло(0, ВсегоНеправильных-1);
				МассивНеправильных.Добавить(МассивВыгрузка[НомерОтвета]);
			КонецЦикла;
		КонецЕсли;
		МассивНеправильных.Добавить(ПравильныйОтветТекст);
		// Перемешивание итогового массива и формирование результата.
		МассивНеправильных = ОбщегоНазначенияКлиентСервер.СмешатьМассив(МассивНеправильных, Гсч);
		ПравильныйОтветНомер = МассивНеправильных.Найти(ПравильныйОтветТекст);
		Если ПравильныйОтветНомер <> Неопределено Тогда
			РезультатФункции.Вставить("НомерПравильного", ПравильныйОтветНомер + 1);
			РезультатФункции.Вставить("МассивОтветов", МассивНеправильных);
		Иначе
			РезультатФункции.Вставить("НомерПравильного", 0);
			РезультатФункции.Вставить("МассивОтветов", Новый Массив);
		КонецЕсли;
	Иначе
		// Не удалось однозначно определить правильный ответ.
		РезультатФункции.Вставить("НомерПравильного", 0);
		РезультатФункции.Вставить("МассивОтветов", Новый Массив);
	КонецЕсли;
	// Вывод результата.
	Возврат РезультатФункции;
КонецФункции		// ПолучитьВариантыОтветов()

#КонецОбласти

#Область Персонажи

// Возвращает массив стартовых модификаторов для указанного персонажа.
//
// Параметры:
//  ПерсонажВход - СправочникСсылка.Персонажи - персонаж, для которого требуется получить модификаторы.
//
// Возвращаемое значение:
//  Массив - массив ссылок типа СправочникСсылка.Модификаторы.
//
Функция ПолучитьСтартовыеМодификаторыПерсонажа(ПерсонажВход) Экспорт
	РезультатФункции = Новый Массив;
	Если ПерсонажВход = Справочники.Персонажи.Профессор Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.Фолиант);
	ИначеЕсли ПерсонажВход = Справочники.Персонажи.Дуэлянт Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.Рапира);
	ИначеЕсли ПерсонажВход = Справочники.Персонажи.Архивариус Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.Гонг);
	ИначеЕсли ПерсонажВход = Справочники.Персонажи.Алхимик Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.БурлящаяРеторта);
	ИначеЕсли ПерсонажВход = Справочники.Персонажи.Софист Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.ПлащМеркурия);
	ИначеЕсли ПерсонажВход = Справочники.Персонажи.Еретик Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.ШипастыйБраслет);
	ИначеЕсли ПерсонажВход = Справочники.Персонажи.Оратор Тогда
		РезультатФункции.Добавить(Справочники.Модификаторы.МраморнаяТрибуна);
	Иначе
		// Для персонажа не предусмотрен стартовый модификатор.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		 // ПолучитьСтартовыеМодификаторыПерсонажа()

#КонецОбласти
